// 지역구 필터링
export type District =
  | "강남구"
  | "강동구"
  | "강북구"
  | "강서구"
  | "관악구"
  | "광진구"
  | "구로구"
  | "금천구"
  | "노원구"
  | "도봉구"
  | "동대문구"
  | "동작구"
  | "마포구"
  | "서대문구"
  | "서초구"
  | "성동구"
  | "성북구"
  | "송파구"
  | "양천구"
  | "영등포구"
  | "용산구"
  | "은평구"
  | "종로구"
  | "중구"
  | "중랑구";

// 교육 카테고리 필터링
export type EduCategory =
  | "취업"
  | "미술"
  | "공예/취미"
  | "자연/과학"
  | "도시농업"
  | "교양/어학"
  | "역사"
  | "청년정보"
  | "기타";

// 교육 모집상태 필터링
export type EduStatus = "모집 전" | "모집 중" | "모집종료";

// 공간 대상자 필터링
export type SpaceTarget = "전체" | "청년" | "예술가";

// 공간 시설유형 필터링
export type SpaceFacility = "도서관" | "기업";
